app/controllers/ideas_controller.rb

INSERT INTO "ideas" ("name", "description", "picture", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Linh"], ["description", "Hello"], ["picture", ""], ["created_at", "2017-09-16 07:33:33.122658"], ["updated_at", "2017-09-16 07:33:33.122658"]]
---
  def create
    @idea = Idea.new(idea_params)

    respond_to do |format|
      if @idea.save

UPDATE "ideas" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "ideas"."id" = ?  [["name", "Linh 2"], ["description", "Heart"], ["updated_at", "2017-09-16 07:51:14.709579"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @idea.update(idea_params)